src/mp_toir/InformationRegisters/ЖурналРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРезультатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщенийЖурналаРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/mp_toir/Enums/ТипыСообщенийЖурналаРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийЖурналаРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/CommonModules/HTTPCore/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// HTTPCore: Основные методы работы HTTP сервиса
// Copyright (c) 2023, ООО "Мечел-ИнфоТех"
// Все права защищены.
//
//   Коды ответов сервера:
//     200 ОК ("хорошо")
//     204 No content ("нет содержимого")
//     400 Bad request ("плохой, неверный запрос")
//     401 Unauthorized ("не авторизован")
//     405 Method Not Allowed ("метод не поддерживается")
//     500 Internel Server Error ("внутренняя ошибка сервера")
//     501 Nor Implemented ("не реализовано")
//
// Коды ошибок возвращаемые в причине для идентификации ошибок в коде
//  1.* - ошибки при регистрации
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОшибкиИСообщения

// Записать мобильную ошибку в журнал результатов
//
// Параметры:
//  ТекстОшибки - Строка - Текст ошибки
//  СтруктураДанных - Структура - Структура передаваемых данных, см.  ПолучитьСтруктуруОбрабатываемыхДанных()
//  КодВозврата - Число - Код возврата
//  ИсключениеОписаниеОшибки - Неопределено, Строка - Исключение описание ошибки
Процедура ЗаписатьМобильнуюОшибку(
	ТекстОшибки, 
	СтруктураДанных, 
	КодВозврата = 0,
	ИсключениеОписаниеОшибки = Неопределено) Экспорт
	
	ТекстОшибкиСтрока = 
		Строка(ТекстОшибки) + ?(ИсключениеОписаниеОшибки = Неопределено, "", Символы.ПС + ИсключениеОписаниеОшибки);
	
	СтруктураДанных.Ошибки.ОшибкиКлиент.Добавить(ТекстОшибкиСтрока);
	СтруктураДанных.КодОтветаHTTP = КодВозврата;
	
	ЗаписатьОшибкуВЖурналСтрокой("МобильноеПриложениеКлиент", ТекстОшибкиСтрока);
	
КонецПроцедуры

// Записать серверную ошибку в журнал результатов
//
// Параметры:
//  ТекстОшибки - Строка - Текст ошибки
//  СтруктураДанных - Структура - Структура передаваемых данных, см.  ПолучитьСтруктуруОбрабатываемыхДанных()
//  КодВозврата - Число - Код возврата
//  ИсключениеОписаниеОшибки - Неопределено, Строка - Исключение описание ошибки
Процедура ЗаписатьСервернуюОшибку(
	ТекстОшибки, 
	СтруктураДанных, 
	КодВозврата = 0,
	ИсключениеОписаниеОшибки = Неопределено) Экспорт
	
	ТекстОшибкиСтрока = 
		Строка(ТекстОшибки) + ?(ИсключениеОписаниеОшибки = Неопределено, "", Символы.ПС + ИсключениеОписаниеОшибки);
	
	СтруктураДанных.Ошибки.ОшибкиСервер.Добавить(ТекстОшибкиСтрока);
	СтруктураДанных.КодОтветаHTTP = КодВозврата;
	
	ЗаписатьОшибкуВЖурналСтрокой("МобильноеПриложениеСервер", ТекстОшибкиСтрока);
	
КонецПроцедуры

Процедура ЗаписатьОшибкиВЖурнал(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.Ошибки.ОшибкиСервер.Количество() > 0 Тогда
		ОбработатьМассивОшибок(СтруктураДанных.Ошибки.ОшибкиСервер, "Сервер");
	КонецЕсли;
	
	Если СтруктураДанных.Ошибки.ОшибкиКлиент.Количество() > 0 Тогда
		ОбработатьМассивОшибок(СтруктураДанных.Ошибки.ОшибкиКлиент, "Клиент");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурналСтрокой(Контекст, ТекстОшибки) Экспорт
	
	ДобавитьЗаписьВЖурнал(Контекст, ТекстОшибки, Перечисления.ТипыСообщенийЖурналаРегистрации.Ошибка);
	
КонецПроцедуры

Процедура ЗаписатьИнформациюВЖурналСтрокой(Контекст, ТекстОшибки) Экспорт
	
	ДобавитьЗаписьВЖурнал(Контекст, ТекстОшибки, Перечисления.ТипыСообщенийЖурналаРегистрации.Информация);
	
КонецПроцедуры

Функция ЕстьОшибка(СтруктураДанных) Экспорт
	
	Если СтруктураДанных.Ошибки.ОшибкиКлиент.Количество() > 0 
		Или СтруктураДанных.Ошибки.ОшибкиСервер.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Сериализация

Функция Сериализовать(ОбъектСериализации) Экспорт
	
	ОбъектXDTO		   = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	ЗаписьXMLОбъект	   = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь);
	ЗаписьXMLОбъект.УстановитьСтроку(ПараметрыЗаписиXML);
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXMLОбъект, ОбъектXDTO);
	
	Возврат ЗаписьXMLОбъект.Закрыть();
	
КонецФункции

Функция Десериализовать(ДанныеXML) Экспорт
	
	ЧтениеXMLОбъект = Новый ЧтениеXML;
	ЧтениеXMLОбъект.УстановитьСтроку(ДанныеXML);
	ДесериализованныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLОбъект);
	ЧтениеXMLОбъект.Закрыть();
	
	Возврат ДесериализованныйОбъект;
	
КонецФункции

#КонецОбласти

#Область Обмен

Функция ПолучитьСтруктуруОбрабатываемыхДанных() Экспорт
	
	СтруктураОшибок = Новый Структура;
	СтруктураОшибок.Вставить("ОшибкиКлиент", Новый Массив);
	СтруктураОшибок.Вставить("ОшибкиСервер", Новый Массив);
	
	СтруктураПланОбмена = Новый Структура;
	СтруктураПланОбмена.Вставить("ПланОбменаКод",					Неопределено);
	СтруктураПланОбмена.Вставить("ПланОбменаНаименование",			Неопределено);
	СтруктураПланОбмена.Вставить("ПланОбменаУзелЦБ",				Неопределено);
	СтруктураПланОбмена.Вставить("ГруппаСкладовОбменаДанными",	Неопределено);
		
	Данные = Новый Структура;
	Данные.Вставить("Ошибки",						СтруктураОшибок);
	Данные.Вставить("КодОтветаHTTP",					200);
	Данные.Вставить("ПланОбмена",					СтруктураПланОбмена);
	
	Данные.Вставить("ИнформацияОбУстройстве",		Неопределено);
	Данные.Вставить("ПакетКлиент",					Неопределено);
	Данные.Вставить("ПакетСервер",					Неопределено);
	Данные.Вставить("ИдентификацияПользователя",	Неопределено);
	Данные.Вставить("БазаЕРП", Неопределено);
	Данные.Вставить("ПараметрыСинхронизации", Неопределено);
	Данные.Вставить("СписокОбновленийДанных", Неопределено);
	Данные.Вставить("ПользователиМП", Неопределено);

	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("УИДТекущегоПользователя", Неопределено);
	ДанныеПользователя.Вставить("УИДТекущегоПодразделения", Неопределено);
	ДанныеПользователя.Вставить("РолиТекущегоПользователя", Неопределено);
	Данные.Вставить("ДанныеПользователя", ДанныеПользователя);
	
	СтруктураОстатки = Новый Структура;
	СтруктураОстатки.Вставить("Код",				"");
	СтруктураОстатки.Вставить("Наименование",	"");
	СтруктураОстатки.Вставить("УИДУзелОбменаОстатков",	"");
	Данные.Вставить("ПланОбменаОстатки",				СтруктураОстатки);
	
	Возврат Данные;
	
КонецФункции

Функция СформироватьПакетОтвета(Пакет) Экспорт
	
	СжатыйПакет = Новый ХранилищеЗначения(Сериализовать(Пакет), Новый СжатиеДанных(9));
	Возврат Сериализовать(СжатыйПакет);
	
КонецФункции

Процедура ПолучитьПакетИзВходящихДанных(Пакет, СтруктураДанных, Сервер = Ложь) Экспорт
	
	Попытка
		ПакетДанных = Десериализовать(Десериализовать(Пакет).Получить());
		Если ТипЗнч(ПакетДанных) = Тип("Структура") Тогда
			Для Каждого ТекущийКлюч Из ПакетДанных Цикл
				СтруктураДанных[ТекущийКлюч.Ключ] = ТекущийКлюч.Значение;
			КонецЦикла;
		КонецЕсли;
		
	Исключение
		Если Сервер = Истина Тогда
			ЗаписатьСервернуюОшибку(
				"HTTPCore.ПолучитьПакетИзВходящихДанных | " + Пакет, СтруктураДанных, 204, ОписаниеОшибки());
		Иначе
			ЗаписатьМобильнуюОшибку(
				"HTTPCore.ПолучитьПакетИзВходящихДанных | " + Пакет, 
				СтруктураДанных, ,
				ОписаниеОшибки());
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОчиститьСодержимоеПакетов(СтруктураДанных) Экспорт
	
	СтруктураДанных.ПакетКлиент = Неопределено;
	СтруктураДанных.ПакетСервер = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОшибкиИСообщения

Процедура ДобавитьЗаписьВЖурнал(Контекст, Данные, ТипСообщения)
	
	ОчиститьЖурнал();
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Для Каждого Строка Из Данные Цикл
			НоваяЗаписьВЖурналРезультатов(Контекст, Строка, ТипСообщения);
		КонецЦикла;
	Иначе
		НоваяЗаписьВЖурналРезультатов(Контекст, Данные, ТипСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура НоваяЗаписьВЖурналРезультатов(Контекст, Данные, ТипСообщения)
	
	НоваяЗапись = РегистрыСведений.ЖурналРезультатов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	
	Попытка
		ID = Константы.ID.Получить();
		НоваяЗапись.ID = ?(ЗначениеЗаполнено(ID), ID, Новый УникальныйИдентификатор);
	Исключение
		НоваяЗапись.ID = Новый УникальныйИдентификатор;
	КонецПопытки;
	
	НоваяЗапись.ТипСообщения = ТипСообщения;
	НоваяЗапись.Контекст	 = Контекст;
	НоваяЗапись.Данные		 = Данные;
	НоваяЗапись.Записать();
	
КонецПроцедуры

Процедура ОчиститьЖурнал()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЖурналРезультатов.ID) КАК КоличествоЗаписей
		|ИЗ
		|	РегистрСведений.ЖурналРезультатов КАК ЖурналРезультатов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Выборка.КоличествоЗаписей > 300 Тогда
			РегистрыСведений.ЖурналРезультатов.ОчиститьЖурналРезультатов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьМассивОшибок(МассивОшибок, КонтекстОшибки)
	
	Ошибка = Перечисления.ТипыСообщенийЖурналаРегистрации.Ошибка;
	ДобавитьЗаписьВЖурнал(КонтекстОшибки, МассивОшибок, Ошибка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
